Revit 2027 API
Document.MullionTypes Property
This property is used to retrieve all the mullion types in current system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MullionTypeSet MullionTypes { get; }
Public ReadOnly Property MullionTypes As MullionTypeSet
	Get
public:
property MullionTypeSet^ MullionTypes {
	MullionTypeSet^ get ();
}
member MullionTypes : MullionTypeSet with get
Property Value
MullionTypeSet
Remarks
This property returns a set of MullionType objects. These objects can be used change the type of a mullion from one type to another.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace